# FluidTemperature Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FluidTemperature Members
FluidTemperature Class Constructors Methods Properties See Also
---
The FluidTemperature type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| FluidTemperature | Creates a new fluid temperature with given temperature, dynamic viscosity and density. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FluidTemperature |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Density | The density value |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Temperature | The temperature value |
| Viscosity | The dynamic viscosity value |

# See Also
FluidTemperature Class
Autodesk.Revit.DB.Plumbing Namespace